Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ОписаниеТипов, Заголовок, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт 
	РабочиеПараметры = А1Э_Структуры.СкопироватьВШаблон(Параметры,
	"ХранитьНачальноеЗначение", Истина,
	"СохраняемыеДанные", Истина,
	);
	
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикКДействиям(РабочиеДействия, "ФормаПриСозданииНаСервере", ИмяМодуля() + ".ФормаПриСозданииНаСервере");
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикКДействиям(РабочиеДействия, "ФормаПриЗаписиНаСервере", ИмяМодуля() + ".ФормаПриЗаписиНаСервере");
	
	//ТУДУ: Рефактор когда будут работать кумулятивные действия.
	А1Э_Формы.ДобавитьОписаниеРеквизитаИЭлемента(МассивОписаний, ИмяКомпонента, ОписаниеТипов, , Заголовок, РодительЭлемента, ПередЭлементом, РабочиеПараметры, РабочиеДействия); 
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт
		УстановитьПривилегированныйРежим(Истина);
		Значение = А1Э_ДопРеквизиты.Значение(Форма.Объект.Ссылка, ИмяКомпонента, "А1Д");
		Форма[ИмяКомпонента] = Значение;
		А1Э_Формы.СинхронизироватьРеквизит(Форма, ИмяКомпонента); 
	КонецФункции
	
	Функция ФормаПриЗаписиНаСервере(ИмяКомпонента, Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт  
		Если НЕ А1Э_Формы.РеквизитИзменен(Форма, ИмяКомпонента) Тогда Возврат Неопределено; КонецЕсли;
		УстановитьПривилегированныйРежим(Истина);
		А1Э_ДопРеквизиты.Установить(ТекущийОбъект.Ссылка, ИмяКомпонента, Форма[ИмяКомпонента], "А1Д");
		А1Э_Формы.СинхронизироватьРеквизит(Форма, ИмяКомпонента);
	КонецФункции 
	
#КонецЕсли
 
Функция ИмяМодуля() Экспорт
	Возврат "А1Д_КомпонентДопПолеОбъекта";
КонецФункции 